<a href="https://colab.research.google.com/github/Jeongyoon-Jang/SOLUX_summer_data/blob/master/1%EC%A3%BC%EC%B0%A8/%ED%8C%90%EB%8B%A4%EC%8A%A4_%EA%B8%B0%EC%B4%88_2(7%EC%9B%9424%EC%9D%BC).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd #pandas를 pd로 쓴다는 말

In [ ]:
df = pd.read_csv('friend_list.csv')

In [ ]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [ ]:
df.head(2) #앞부분 2개

    name  age        job
0   John   20    student
1  Jenny   30  developer

In [ ]:
df.tail(3) #뒷부분 3개

    name  age      job
3  Julia   40  dentist
4  Brian   45  manager
5  Chris   25   intern

In [ ]:
df = pd.read_csv('friend_list.txt') # 쉼표로 구분된 텍스트 파일 불러오기

In [ ]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [ ]:
df = pd.read_csv('friend_list_tab.txt') # tab으로 구분된 텍스트 파일(tab이 데이터 안에 들어가게됨)

In [ ]:
df

         name\tage\tjob
0     John\t20\tstudent
1  Jenny\t30\tdeveloper
2     Nate\t30\tteacher
3    Julia\t40\tdentist
4    Brian\t45\tmanager
5     Chris\t25\tintern

In [ ]:
df = pd.read_csv('friend_list_tab.txt', delimiter = '\t')

In [ ]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [ ]:
df = pd.read_csv('friend_list_no_head.csv', header = None) # header가 없는 경우

In [ ]:
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

In [ ]:
df.columns = ['name','age','job'] # pandas의 이름 지정

In [ ]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [ ]:
df = pd.read_csv('friend_list_no_head.csv', header= None, names = ['name','age','job']) # 앞의 두 단계를 한번에 정리하여 쓰는 법

In [ ]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern